{
  "personalSection": {
    "firstName": "John",
    "lastName": "Van Note",
    "address": {
      "street": "800 P St. NW",
      "additionalStreet": "Apt. 620",
      "city": "Washington",
      "state": "DC",
      "zip": "20001"
    },
    "phoneNumber": "215.518.0823",
    "email": "johnlvannote@protonmail.com",
    "website": "https://github.com/johnvannote"
  },
  "experienceSection": {
    "experiences": [
      {
        "title": "Senior Software Engineer",
        "tenure": {
          "startDate": {
            "year": 2017,
            "month": "MARCH"
          },
          "endDate": null
        },
        "company": "Ernst \\& Young (acquired from Sila Solutions Group in December 2019)",
        "address": {
          "street": null,
          "additionalStreet": null,
          "city": "Arlington",
          "state": "VA",
          "zip": null
        },
        "technologyUsed": [
          "Java",
          "Vagrant/VirtualBox",
          "Jenkins",
          "Git/SVN",
          "Apache Tomcat",
          "Docker",
          "Bash/Shell",
          "AWS"
        ],
        "highlights": [
          "Served as the technical lead on several IGA platform implementations, using Java to build customizations on the SailPoint IdentityIQ (IIQ) solution across clients in the retail, housing, pharmaceutical, and insurance industries.",
          "Drove the adoption of unit testing practices on multiple projects, leveraging the TestNG and EasyMock testing frameworks to reduce code duplication, lower risk associated with refactoring, and bug reduction.",
          "Automated deployment and upgrade processes using a Jenkins pipeline and Artifactory for shorter, smaller, and more frequent deployments.",
          "Designed the architecture for a resume parsing application using a model-view-controller (MVC) design pattern with a ReactJS front end, Java/Spring Boot back end, ElasticSearch data storage, and Jenkins/Maven build automation.",
          "Contributor to a series of internal development tools and libraries, primarily responsible for code maintenance, developing enhancements, unit testing coverage, and code reviews of new features.",
          "Managed multiple development work streams using release- and feature-based branching models.",
          "Used the feature flag software development technique to decouple the deployment of functionality from its release.",
          "Trained to over 70 junior engineers by providing guidance and participating in code quality reviews.",
          "Integrated IIQ with several down stream systems, including: Active Directory, LDAP (389 DS, ADLDS, OpenLDAP), MainFrame (CA Top Secret, IBM System i, RACF), JDBC (Microsoft SQL, MySQL, Oracle PL/SQL), Okta, SAP (BusinessObjects, ERP, Portal, SRM), Workday, and REST APIs."
        ]
      },
      {
        "title": "Software Support Engineer",
        "tenure": {
          "startDate": {
            "year": 2015,
            "month": "MARCH"
          },
          "endDate": {
            "year": 2017,
            "month": "MARCH"
          }
        },
        "company": "Corporation Service Company",
        "address": {
          "street": null,
          "additionalStreet": null,
          "city": "Wilmington",
          "state": "DE",
          "zip": null
        },
        "technologyUsed": [
          "Java/Groovy",
          "Python",
          "Bash/Shell",
          "Apache HTTP Server",
          "Apache Tomcat",
          "IIS",
          "Oracle WebLogic",
          "Git",
          "VirtualBox"
        ],
        "highlights": [
          "Designed and developed a Groovy application, which automated a previously manually-compiled monthly application performance index using the Splunk SDK in Java and reading from an Oracle database.",
          "Engineered and supported the implementation of enterprise ETL and Business Intelligence Reporting tools across four environments, spanning more than fourteen application servers.",
          "Automated reporting processes using VBA, which parsed data and generated charts in Microsoft Excel with a single click.",
          "Developed a solution to remediate application latency in an Apache Tomcat application by creating an extensible custom solution in Python to execute Shell commands on Linux servers. "
        ]
      }
    ],
    "title": "Experience"
  },
  "educationSection": {
    "schools": [
      {
        "degree": "Bachelor of Science in Business Administration, Minor in Computer Science",
        "name": "Drexel University",
        "address": {
          "street": null,
          "additionalStreet": null,
          "city": "Philadelphia",
          "state": "PA",
          "zip": null
        },
        "gpa": "3.59",
        "tenure": {
          "startDate": {
            "year": 2008,
            "month": "SEPTEMBER"
          },
          "endDate": {
            "year": 2013,
            "month": "JUNE"
          }
        }
      }
    ],
    "title": "Education"
  },
  "technicalSection": {
    "toolSet": [
      {
        "label": "Programming/Scripting Languages",
        "tools": [
          "Java",
          "Groovy",
          "Python",
          "Bash/Shell",
          "VBA"
        ]
      },
      {
        "label": "Development Tools",
        "tools": [
          "Git/SVN",
          "Vagrant",
          "Jenkins",
          "Maven/Ant",
          "IntelliJ/Eclipse"
        ]
      },
      {
        "label": "Web Servers",
        "tools": [
          "Apache Tomcat",
          "Apache HTTP Server",
          "IIS",
          "Oracle WebLogic"
        ]
      },
      {
        "label": "Databases",
        "tools": [
          "Oracle",
          "MySQL",
          "MsSQL",
          "Amazon Aurora"
        ]
      }
    ],
    "title": "Technical Tools"
  },
  "theme": "CLASSIC",
  "fontSize": "ELEVEN",
  "fontFamily": "SANS",
  "paperSize": "A4",
  "color": "BLACK"
}